from django.test import TestCase

# Create your tests here.

aa = [
    {
        "id": 1111001,
        "name": "通信与信息工程学院"
    },
    {
        "id": 1111002,
        "name": "电子工程学院"
    },
    {
        "id": 1111003,
        "name": "计算机学院"
    },
    {
        "id": 1111004,
        "name": "自动化学院"
    },
    {
        "id": 1111005,
        "name": "经济与管理学院"
    },
    {
        "id": 1111006,
        "name": "理学院"
    },
    {
        "id": 1111007,
        "name": " 人文与外国语学院"
    },
    {
        "id": 1111009,
        "name": "马克思主义学院"
    },
    {
        "id": 1111011,
        "name": "现代邮政学院"
    },
    {
        "id": 1111016,
        "name": "网络空间安全学院"
    },
    {
        "id": 2020200,
        "name": "020200应用经济学"
    },
    {
        "id": 2030500,
        "name": "030500 马克思主义理论"
    },
    {
        "id": 2055100,
        "name": "055100翻译"
    },
    {
        "id": 2070200,
        "name": "070200 物理学"
    },
    {
        "id": 2077500,
        "name": "077500 计算机科学与技术"
    },
    {
        "id": 2080300,
        "name": "080300 光学工程"
    },
    {
        "id": 2080900,
        "name": "080900 电子科学与技术"
    },
    {
        "id": 2081000,
        "name": "081000 信息与通信工程"
    },
    {
        "id": 2081100,
        "name": "081100控制科学与工程"
    },
    {
        "id": 2081200,
        "name": "081200 计算机科学与技术"
    },
    {
        "id": 2083500,
        "name": "083500 软件工程"
    },
    {
        "id": 2083900,
        "name": "083900 网络空间安全"
    },
    {
        "id": 2085400,
        "name": "085400 电子信息"
    },
    {
        "id": 2085500,
        "name": "085500机械"
    },
    {
        "id": 2086100,
        "name": "086100 交通运输"
    },
    {
        "id": 2087100,
        "name": "087100 管理科学与工程"
    },
    {
        "id": 2120100,
        "name": "120100 管理科学与工程"
    },
    {
        "id": 2120200,
        "name": "120200 工商管理"
    },
    {
        "id": 2125100,
        "name": "125100 工商管理"
    },
    {
        "id": 2125300,
        "name": "125300 会计"
    },
    {
        "id": 2125604,
        "name": "125604物流工程与管理"
    },
    {
        "id": 2185400,
        "name": "085400 电子信息"
    },
    {
        "id": 3202001,
        "name": "01(全日制)产业经济学"
    },
    {
        "id": 3202002,
        "name": "02(全日制)区域经济学"
    },
    {
        "id": 3202003,
        "name": "03(全日制)国民经济学"
    },
    {
        "id": 3202004,
        "name": "04(全日制)金融学"
    },
    {
        "id": 3203001,
        "name": "01(全日制)马克思主义基本原理"
    },
    {
        "id": 3203002,
        "name": "02(全日制)马克思主义中国化"
    },
    {
        "id": 3203003,
        "name": "03(全日制)思想政治教育"
    },
    {
        "id": 3203004,
        "name": "04(全日制)中国近现代史基本问题"
    },
    {
        "id": 3205501,
        "name": "01(全/非日制)信息科技英汉笔译"
    },
    {
        "id": 3207001,
        "name": "01(全日制)量子物理"
    },
    {
        "id": 3207002,
        "name": "02(全日制)计算物理"
    },
    {
        "id": 3207003,
        "name": "03(全日制)材料物理"
    },
    {
        "id": 3207701,
        "name": "01(全日制)数据科学与知识工程"
    },
    {
        "id": 3207702,
        "name": "02(全日制)智能计算与感知"
    },
    {
        "id": 3208001,
        "name": "01(全日制)光通信与光信息技术"
    },
    {
        "id": 3208002,
        "name": "02（全日制）光电子技术及应用"
    },
    {
        "id": 3208003,
        "name": "03（全日制）光电传感、测量与显示技术"
    },
    {
        "id": 3208004,
        "name": "04(全日制)光电信息技术与应用"
    },
    {
        "id": 3208005,
        "name": "05(全日制)导航与定位"
    },
    {
        "id": 3208101,
        "name": "01(全日制)宽带无线通信"
    },
    {
        "id": 3208102,
        "name": "02(全日制)视频图像处理"
    },
    {
        "id": 3208103,
        "name": "03(全日制)网络应用与智能处理"
    },
    {
        "id": 3208104,
        "name": "04(全日制)光通信与光信息技术方向"
    },
    {
        "id": 3208301,
        "name": "01(全日制)可信软件理论与方法"
    },
    {
        "id": 3208302,
        "name": "02(全日制)软件质量保证与测试"
    },
    {
        "id": 3208303,
        "name": "03(全日制)软件服务技术及应用"
    },
    {
        "id": 3208501,
        "name": "01(全/非日制)电子与通信工程"
    },
    {
        "id": 3208502,
        "name": "02(全/非日制)集成电路工程"
    },
    {
        "id": 3208503,
        "name": "03(全/非日制)光通信与光信息技术"
    },
    {
        "id": 3208601,
        "name": "01(全日制)物流工程"
    },
    {
        "id": 3208701,
        "name": "01(全日制)邮政工程与网络优化"
    },
    {
        "id": 3208702,
        "name": "02(全日制)知识管理与信息系统"
    },
    {
        "id": 3208703,
        "name": "03(全日制)电子商务与物流管理"
    },
    {
        "id": 3208704,
        "name": "04(全日制)智能计算与决策分析"
    },
    {
        "id": 3212001,
        "name": "01(全日制)管理科学与决策"
    },
    {
        "id": 3212002,
        "name": "02(全日制)邮政工程与网络优化"
    },
    {
        "id": 3212003,
        "name": "03(全日制)知识管理与信息系统"
    },
    {
        "id": 3212004,
        "name": "04(全日制)电子商务与物流管理"
    },
    {
        "id": 3212501,
        "name": "01 (非全日制)不区分研究方向    "
    },
    {
        "id": 3218501,
        "name": "01(全/非日制)宽带通信技术及应用"
    }
]


print(len(aa))


if __name__ == '__main__':
    pass
